package quiz;

public class A01_Money {
	public static void main(String[] args) {
		System.out.println("              #### 회비 정보 ####             ");
		System.out.println("===========================================");
		System.out.println("이름\t나이\t전화번호\t\t회비");
		System.out.println("===========================================");
		System.out.println("홍길동\t\"15\"\t010-123-1234\t￦20,000");
		System.out.println("임꺽정\t\"20\"\t010-234-2345\t￦30,000");
		System.out.println("김말이\t\"28\"\t010-345-3456\t￦50,000");
		System.out.println("-------------------------------------------");
		System.out.println("총합계\t\t\t\t￦100,000");
		System.out.println("===========================================");
	}
}

/*
	              #### 회비 정보 ####             
	===========================================
	이름		나이		전화번호			회비
	===========================================
	홍길동		"15"	010-123-1234	￦20,000
	임꺽정		"20"	010-234-2345	￦30,000
	김말이		"28"	010-345-3456	￦50,000
	-------------------------------------------
	총합계								￦100,000
	===========================================
*/