package quiz;

public class B08_ContinueQuiz {

	/*
		1. 600부터 800사이에 있는 7의 배수를 모두 출력
		2. 1부터 200까지의 숫자 중 2와 3의 배수가 아닌 숫자들 모두 출력
		3. 출력했던 모든 숫자들의 합을 출력
	*/
	
	public static void main(String[] args) {
		int sum = 0;
		
		System.out.println("<1>----------------------------------------");
		
		for (int i = 600, j = 0; i <= 800; i++) {
			// 7의 배수가 아니면 continue
			if (i % 7 != 0)
				continue;
			
			sum += i;
			System.out.printf("%3d ", i);
			
			if (++j % 10 == 0)
				System.out.println();
		}
		
		System.out.println();

		System.out.println("<2>----------------------------------------");
		
		for (int i = 1, j = 0; i <= 200; i++) {
			// 2 또는 3의 배수인 경우 continue
			if (i % 2 == 0 || i % 3 == 0)
				continue;

			sum += i;
			System.out.printf("%3d ", i);
			
			if (++j % 10 == 0)
				System.out.println();
		}

		System.out.println();

		System.out.println("<3>----------------------------------------");
		
		System.out.printf("sum: %d \n", sum);

	}
}

/*
<1>----------------------------------------
602 609 616 623 630 637 644 651 658 665 
672 679 686 693 700 707 714 721 728 735 
742 749 756 763 770 777 784 791 798 
<2>----------------------------------------
  1   5   7  11  13  17  19  23  25  29 
 31  35  37  41  43  47  49  53  55  59 
 61  65  67  71  73  77  79  83  85  89 
 91  95  97 101 103 107 109 113 115 119 
121 125 127 131 133 137 139 143 145 149 
151 155 157 161 163 167 169 173 175 179 
181 185 187 191 193 197 199 
<3>----------------------------------------
sum: 27033 
*/